# მომხმარებლის ასაკის კატეგორიზაცია
# შექმენი პროგრამა, რომელიც მიიღებს მომხმარებლის ასაკს და დააბრუნებს შეტყობინებას იმის მიხედვით, თუ რომელ ასაკობრივ კატეგორიაშია მომხმარებელი.

def ასაკის_კატეგორიზაცია(ასაკი):
    if ასაკი < 13:
        return 'თქვენ ხართ ბავშვი.'
    elif 13 <= ასაკი <= 20:
        return 'თქვენ ხართ თინეიჯერი.'
    elif 20 <= ასაკი < 60:
        return 'თქვენ ხართ ზრდასრული.'
    else:
        return 'თქვენ ხართ მოხუცი.'

ასაკი = int(input("შეიყვანეთ თქვენი ასაკი: "))
შეტყობინება = ასაკის_კატეგორიზაცია(ასაკი)
print(შეტყობინება)